modules/coding/freemacs-coding.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title: Coding Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2022-07-07 17:21:29 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


The following customizations are used to improve the coding environment in Emacs.

* Aggressive Indent

[[https://github.com/Malabarba/aggressive-indent-mode][Aggressive Indent mode]] will keep code indented by the correct amount as you type in real time. This saves having to go back and reformat all the tabbing in code after making changes.

#+begin_src emacs-lisp :tangle yes
  (use-package aggressive-indent
    :straight t
    :hook
    (c-mode . aggressive-indent-mode)
    (emacs-lisp-mode . aggressive-indent-mode)
    (go-mode . aggressive-indent-mode))
#+end_src

* Apheleia :python:go:

[[https://github.com/raxod502/apheleia][Apheleia]] will format programming code using code formatters such as Black for Python. The main difference between using Apheleia over formatters like Black is that Apheleia will format the code asynchronously in the background without disturbing your cursor position in the buffer making a more streamlined experience that is more pleasant for editing and saving repeatedly as I often do.

#+begin_src emacs-lisp :tangle yes
  (use-package apheleia
    :straight (apheleia :host github
                        :repo "radian-software/apheleia"
                        :branch "main")
    :hook
    (prog-mode . apheleia-mode)
    (tex-mode . apheleia-mode)
    :config
    (setf (alist-get 'black apheleia-formatters)
    '("black" "--experimental-string-processing" "-")))
#+end_src

* C

I have added ~.ino~ files to C mode so that I can have syntax highlighting when I program my Arduino board.

#+begin_src emacs-lisp :tangle yes
  (use-package c-mode
    :straight (:type built-in)
    :defer t
    :mode ("\\.c\\'"
           "\\.ino\\'"))
#+end_src

* Eglot

[[https://github.com/joaotavora/eglot][Eglot]] is a client for the language server protocal (LSP) that uses a lot of the built-in Emacs functions and runs quickly.

#+begin_src emacs-lisp :tangle yes
  (use-package eglot
    :straight t
    :hook
    (python-mode . eglot-ensure))
#+end_src

* Flycheck :python:

[[https://www.flycheck.org/en/latest/][Flycheck]] can check programming syntax while typing.

#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :straight t
    :hook
    (prog-mode . flycheck-mode))
#+end_src

* Go

[[https://github.com/dominikh/go-mode.el][Go mode]] provides a major model for editing Go code.

#+begin_src emacs-lisp :tangle yes
  (use-package go-mode
    :straight t
    :defer t)
#+end_src

* Minimap

[[https://github.com/dengste/minimap][Minimap]] shows a smaller window next to the main window where an overview of the whole buffer is presented and displays where the active region relates to the overall structure.

#+begin_src emacs-lisp :tangle yes
  (use-package minimap
    :straight t
    :defer t)
#+end_src

