modules/coding/freemacs-coding.org
* Magit :git:

[[https://magit.vc/][Magit]] provides an interface to Git through Emacs. It is very helpful to be able to command Git with Magit as it requires much less context switching since I do not need to save code and then switch to a terminal to run Git commands.

#+begin_src emacs-lisp :tangle yes
  (use-package magit
    :init
    (whicher "git")
    :straight t
    :bind ("C-x g" . magit-status))
#+end_src

* Number Line Mode

Number lines can be very useful in programming modes. This code below will turn on the built-in ~display-line-numbers-mode~ in any major mode that inherits from ~prog-mode~. With wide monitors these days it is less of an issue and it can always toggled off with  ~display-line-numbers-mode~ on the fly.

#+begin_src emacs-lisp :noweb-ref emacs_config
    (when (version<= "26.0.50" emacs-version)
      (add-hook 'prog-mode-hook 'display-line-numbers-mode))
#+end_src

* Numpydoc

Using [[https://github.com/douglasdavis/numpydoc.el][Numpydoc]] provides an interactive tool to automatically generate Numpy style docstrings.

#+begin_src emacs-lisp :tangle yes
  (use-package numpydoc
    :straight t
    :bind (:map python-mode-map
                ("C-c C-n" . numpydoc-generate)))
#+end_src

* Paren Mode

Paren Mode will highlight matching parentheses in programming mode buffers making it easy to determine if delimiters have been matched and what nested-level code is being written in.

The following code will always highlight matching parenthesis when coding /immediately/ without delay. A hook was added to defer loading the package until a programming mode:

#+begin_src emacs-lisp :tangle yes  
  (use-package paren
    :straight (:type built-in)
    :defer t
    :custom
    (show-paren-delay 0)
    :hook (prog-mode . show-paren-mode))
#+end_src

* Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][Rainbow delimiters]] colors delimiters such as brackets and parentheses in source code making it easier to identify which delimiters are paired up. This can be a quick and easy way to check to see if all open delimiters are closed off without having to rely entirely on ~paren-mode~ and ~backward-sexp~.

#+begin_src emacs-lisp :tangle yes
  (use-package rainbow-delimiters
    :straight t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Treemacs

[[https://github.com/Alexander-Miller/treemacs][Treemacs]] provides a separate Emacs window to browse file directory trees for projects.

#+begin_src emacs-lisp :tangle yes
  (use-package treemacs
    :straight t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :custom
    (treemacs-show-hidden-files t)
    (treemacs-wide-toggle-width 60)
    (treemacs-width 30)
    (treemacs-width-is-initially-locked nil)
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (treemacs-hide-gitignored-files-mode nil)
    :config
    (treemacs-load-theme "all-the-icons")
    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-all-the-icons
    :after treemacs
    :straight t
    :config (treemacs-load-theme 'all-the-icons))

  (use-package treemacs-magit
    :after (treemacs magit)
    :straight t)
#+end_src

