docs/modules/coding/freemacs-coding.html

      <div id="outline-container-orgd226207" class="outline-2">
        <h2 id="orgd226207">Magit</h2>
        <div class="outline-text-2" id="text-orgd226207">
          <p>
            <a href="https://magit.vc/">Magit</a> provides an interface to Git
            through Emacs. It is very helpful to be able to command Git with
            Magit as it requires much less context switching since I do not need
            to save code and then switch to a terminal to run Git commands.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">magit</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"git"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:bind</span> <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-x g"</span> . magit-status<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-org8a7efe8" class="outline-2">
        <h2 id="org8a7efe8">Number Line Mode</h2>
        <div class="outline-text-2" id="text-org8a7efe8">
          <p>
            Number lines can be very useful in programming modes. This code
            below will turn on the built-in
            <code>display-line-numbers-mode</code> in any major mode that
            inherits from <code>prog-mode</code>. With wide monitors these days
            it is less of an issue and it can always toggled off with
            <code>display-line-numbers-mode</code> on the fly.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>version&lt;= <span style="color: #7984D1;">"26.0.50"</span> emacs-version<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-hook 'prog-mode-hook 'display-line-numbers-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-org7a90e88" class="outline-2">
        <h2 id="org7a90e88">Numpydoc</h2>
        <div class="outline-text-2" id="text-org7a90e88">
          <p>
            Using
            <a href="https://github.com/douglasdavis/numpydoc.el">Numpydoc</a>
            provides an interactive tool to automatically generate Numpy style
            docstrings.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">numpydoc</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:bind</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:map</span> python-mode-map
              <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c C-n"</span> . numpydoc-generate<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-org00fb19f" class="outline-2">
        <h2 id="org00fb19f">Paren Mode</h2>
        <div class="outline-text-2" id="text-org00fb19f">
          <p>
            Paren Mode will highlight matching parentheses in programming mode
            buffers making it easy to determine if delimiters have been matched
            and what nested-level code is being written in.
          </p>

          <p>
            The following code will always highlight matching parenthesis when
            coding <i>immediately</i> without delay. A hook was added to defer
            loading the package until a programming mode:
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">paren</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:type</span> built-in<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>show-paren-delay 0<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:hook</span> <span style="color: #ff2afc;">(</span>prog-mode . show-paren-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-orga05b74e" class="outline-2">
        <h2 id="orga05b74e">Rainbow Delimiters</h2>
        <div class="outline-text-2" id="text-orga05b74e">
          <p>
            <a href="https://github.com/Fanael/rainbow-delimiters"
              >Rainbow delimiters</a
            >
            colors delimiters such as brackets and parentheses in source code
            making it easier to identify which delimiters are paired up. This
            can be a quick and easy way to check to see if all open delimiters
            are closed off without having to rely entirely on
            <code>paren-mode</code> and <code>backward-sexp</code>.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">rainbow-delimiters</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:hook</span> <span style="color: #ff2afc;">(</span>prog-mode . rainbow-delimiters-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-orgec9a51b" class="outline-2">
        <h2 id="orgec9a51b">Treemacs</h2>
        <div class="outline-text-2" id="text-orgec9a51b">
          <p>
            <a href="https://github.com/Alexander-Miller/treemacs">Treemacs</a>
            provides a separate Emacs window to browse file directory trees for
            projects.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">treemacs</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">with-eval-after-load</span> 'winum
    <span style="color: #a7da1e;">(</span>define-key winum-keymap <span style="color: #df85ff;">(</span>kbd <span style="color: #7984D1;">"M-0"</span><span style="color: #df85ff;">)</span> #'treemacs-select-window<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>treemacs-show-hidden-files t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-wide-toggle-width 60<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-width 30<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-width-is-initially-locked nil<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-follow-mode t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-filewatch-mode t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-fringe-indicator-mode 'always<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>treemacs-hide-gitignored-files-mode nil<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">pcase</span> <span style="color: #a7da1e;">(</span>cons <span style="color: #df85ff;">(</span>not <span style="color: #A875FF;">(</span>null <span style="color: #1ea8fc;">(</span>executable-find <span style="color: #7984D1;">"git"</span><span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
               <span style="color: #df85ff;">(</span>not <span style="color: #A875FF;">(</span>null treemacs-python-executable<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>`<span style="color: #df85ff;">(</span>t . t<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span>treemacs-git-mode 'deferred<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>`<span style="color: #df85ff;">(</span>t . _<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span>treemacs-git-mode 'simple<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:bind</span>
  <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:map</span> global-map
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-0"</span>       . treemacs-select-window<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t 1"</span>   . treemacs-delete-other-windows<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t t"</span>   . treemacs<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t d"</span>   . treemacs-select-directory<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t B"</span>   . treemacs-bookmark<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t C-t"</span> . treemacs-find-file<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x t M-t"</span> . treemacs-find-tag<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>


<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">treemacs-magit</span>
  <span style="color: #1ea8fc;">:after</span> <span style="color: #ff2afc;">(</span>treemacs magit<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:straight</span> t<span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>
